In [1]:
import pandas as pd 
import numpy as np

In [2]:
df = pd.read_csv('../Sample Data/Nyc_Data.csv')

In [3]:
df.head()

,EST,Temperature,DewPoint,Humidity,Sea Level PressureIn,VisibilityMiles,WindSpeedMPH,PrecipitationIn,CloudCover,Events,WindDirDegrees
0,1/1/2016,38,23,52,30.03,10,8.0,0,5,NaN,281
1,1/2/2016,36,18,46,30.02,10,7.0,0,3,NaN,275
2,1/3/2016,40,21,47,29.86,10,8.0,0,1,NaN,277
3,1/4/2016,25,9,44,30.05,10,9.0,0,3,NaN,345
4,1/5/2016,20,-3,41,30.57,10,5.0,0,0,NaN,333

In [40]:
df['Temperature'].max()

50

In [46]:
df[['EST','Events']][df['Events'] == 'Rain']

          EST Events
8    1/9/2016   Rain
9   1/10/2016   Rain
15  1/16/2016   Rain
26  1/27/2016   Rain

In [47]:
 weather = {
     'day': ['1/1/2017','1/2/2017','1/3/2017','1/4/2017','1/5/2017','1/6/2017'],
    'temperature': [32,35,28,24,32,31],
    'windspeed':[6,7,2,7,4,2],	
    'event':['Rain','Sunny','Snow','Snow','Rain','Sunny'] }

In [49]:
df1 = pd.DataFrame(weather)

In [50]:
df1[df1['event'] == 'Snow']

        day  temperature  windspeed event
2  1/3/2017           28          2  Snow
3  1/4/2017           24          7  Snow

In [51]:
df1.dtypes

day            object
temperature     int64
windspeed       int64
event          object
dtype: object

In [52]:
df1[['day','event','windspeed']][df1['day'] == '1/4/2017']

        day event  windspeed
3  1/4/2017  Snow          7

In [53]:
df1['day'][(df1['event'] == 'Sunny') & (df1['temperature'] >= 25)]

1    1/2/2017
5    1/6/2017
Name: day, dtype: object

In [54]:
df2 = df1.set_index('day')

In [55]:
df2.head()

          temperature  windspeed  event
day
1/1/2017           32          6   Rain
1/2/2017           35          7  Sunny
1/3/2017           28          2   Snow
1/4/2017           24          7   Snow
1/5/2017           32          4   Rain

In [56]:
df2.loc['1/1/2017']

temperature      32
windspeed         6
event          Rain
Name: 1/1/2017, dtype: object

In [70]:
c_data = pd.read_csv('../Sample Data/Company.csv',
                         header=None,
                        names=['tickers','eps','revenue','price','people'],
                        na_values={'eps':['not available','n.a.'], 
                                    'revenue':[-1],
                                    'price':['n.a.'], 
                                    'people':['n.a.']}
                    )

In [71]:
c_data.head()

  tickers    eps  revenue   price         people
0   GOOGL  27.82     87.0   845.0     larry page
1     WMT   4.61    484.0    65.0            NaN
2    MSFT  -1.00     85.0    64.0     bill gates
3     RIL    NaN     50.0  1023.0  mukesh ambani
4    TATA   5.60      NaN     NaN     ratan tata

In [76]:
with pd.ExcelWriter('Combine.xlsx') as writer:
     df.to_excel(writer,sheet_name='weather',index=False)
     c_data.to_excel(writer,sheet_name='Stock',index=False)

In [84]:
Miss_Data = pd.read_csv('../Sample Data/Miss_Data.csv',parse_dates=['day'])

In [90]:
Miss_Data

         day  temperature  windspeed   event
0 2016-01-01         38.0        6.0    Rain
1 2016-01-04          NaN        9.0   Sunny
2 2016-01-05         28.0        NaN    Snow
3 2016-01-06          NaN        7.0     NaN
4 2016-01-07         32.0        NaN    Rain
5 2016-01-08          NaN        NaN   Sunny
6 2016-01-09          NaN        NaN     NaN
7 2016-01-10         34.0        8.0  Cloudy
8 2016-01-11         40.0       12.0   Sunny

In [91]:
Miss_Data.set_index('day',inplace=True)

In [96]:
Miss_Data1 = Miss_Data.fillna({
    'temperature':0,
    'windspeed':0, 
    'event':'No Event'
}
)
Miss_Data1

            temperature  windspeed     event
day
2016-01-01         38.0        6.0      Rain
2016-01-04          0.0        9.0     Sunny
2016-01-05         28.0        0.0      Snow
2016-01-06          0.0        7.0  No Event
2016-01-07         32.0        0.0      Rain
2016-01-08          0.0        0.0     Sunny
2016-01-09          0.0        0.0  No Event
2016-01-10         34.0        8.0    Cloudy
2016-01-11         40.0       12.0     Sunny

In [100]:
 Miss_Data1 = Miss_Data.fillna(method='ffill', limit =1)    # Copy only once

In [101]:
Miss_Data1

            temperature  windspeed   event
day
2016-01-01         38.0        6.0    Rain
2016-01-04         38.0        9.0   Sunny
2016-01-05         28.0        9.0    Snow
2016-01-06         28.0        7.0    Snow
2016-01-07         32.0        7.0    Rain
2016-01-08         32.0        NaN   Sunny
2016-01-09          NaN        NaN   Sunny
2016-01-10         34.0        8.0  Cloudy
2016-01-11         40.0       12.0   Sunny

In [104]:
Miss_Data2 = Miss_Data.interpolate(method='time')
Miss_Data2

            temperature  windspeed   event
day
2016-01-01    38.000000       6.00    Rain
2016-01-04    30.500000       9.00   Sunny
2016-01-05    28.000000       8.00    Snow
2016-01-06    30.000000       7.00     NaN
2016-01-07    32.000000       7.25    Rain
2016-01-08    32.666667       7.50   Sunny
2016-01-09    33.333333       7.75     NaN
2016-01-10    34.000000       8.00  Cloudy
2016-01-11    40.000000      12.00   Sunny

In [107]:
Miss_Data2.dropna(how='all')

            temperature  windspeed   event
day
2016-01-01    38.000000       6.00    Rain
2016-01-04    30.500000       9.00   Sunny
2016-01-05    28.000000       8.00    Snow
2016-01-06    30.000000       7.00     NaN
2016-01-07    32.000000       7.25    Rain
2016-01-08    32.666667       7.50   Sunny
2016-01-09    33.333333       7.75     NaN
2016-01-10    34.000000       8.00  Cloudy
2016-01-11    40.000000      12.00   Sunny

In [113]:
Miss_Data2.dropna(thresh=2,inplace=True)

In [114]:
dt = pd.date_range('01-01-2017','01-11-2017')
inx = pd.DatetimeIndex(dt)
Miss_Data = Miss_Data2.reindex(inx)

In [115]:
Miss_Data

            temperature  windspeed event
2017-01-01          NaN        NaN   NaN
2017-01-02          NaN        NaN   NaN
2017-01-03          NaN        NaN   NaN
2017-01-04          NaN        NaN   NaN
2017-01-05          NaN        NaN   NaN
2017-01-06          NaN        NaN   NaN
2017-01-07          NaN        NaN   NaN
2017-01-08          NaN        NaN   NaN
2017-01-09          NaN        NaN   NaN
2017-01-10          NaN        NaN   NaN
2017-01-11          NaN        NaN   NaN